## jupyter notebook

In [2]:
import pandas as pd
import random

In [3]:
data = pd.DataFrame({'name':('chen','wang','liu'),'age':[11,23,42]})
data

   name  age
0  chen   11
1  wang   23
2   liu   42

In [6]:
nums = list(range(1,4))
random.shuffle(nums)
nums

[3, 2, 1]

In [22]:
data_new = data.assign(
     num = nums
).copy()

In [30]:
data_new.drop(0,axis = 0)

   name  age  num
1  wang   23    2
2   liu   42    1